load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up - 10 requests/sec"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load - 50 requests/sec"
    - duration: 60
      arrivalRate: 100
      name: "Peak load - 100 requests/sec"
  
scenarios:
  - name: "Get All Products"
    flow:
      - get:
          url: "/api/products"
          
  - name: "Get Product by ID"
    flow:
      - get:
          url: "/api/products/{{ $randomString() }}"
          
  - name: "Search Products"
    flow:
      - get:
          url: "/api/search?q=laptop"
          
  - name: "Newsletter Subscription"
    flow:
      - post:
          url: "/api/newsletter/subscribe"
          json:
            email: "loadtest{{ $randomNumber(1, 10000) }}@example.com"